Youning5031/GameM-STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define timebase htim2
#define audio_tim htim1
#define AUDIO_CHANNEL TIM_CHANNEL_1
#define SCREEN_RST_Pin GPIO_PIN_2
#define SCREEN_RST_GPIO_Port GPIOA
#define SCREEN_BL_Pin GPIO_PIN_3
#define SCREEN_BL_GPIO_Port GPIOA
#define SCREEN_CS_Pin GPIO_PIN_4
#define SCREEN_CS_GPIO_Port GPIOA
#define SCREEN_CLK_Pin GPIO_PIN_5
#define SCREEN_CLK_GPIO_Port GPIOA
#define SCREEN_DC_Pin GPIO_PIN_6
#define SCREEN_DC_GPIO_Port GPIOA
#define SCREEN_DT_Pin GPIO_PIN_7
#define SCREEN_DT_GPIO_Port GPIOA
#define BUTTON_b_Pin GPIO_PIN_0
#define BUTTON_b_GPIO_Port GPIOB
#define BUTTON_down_Pin GPIO_PIN_1
#define BUTTON_down_GPIO_Port GPIOB
#define BUTTON_right_Pin GPIO_PIN_10
#define BUTTON_right_GPIO_Port GPIOB
#define BUTTON_left_Pin GPIO_PIN_11
#define BUTTON_left_GPIO_Port GPIOB
#define BUTTON_a_Pin GPIO_PIN_12
#define BUTTON_a_GPIO_Port GPIOB
#define BUTTON_up_Pin GPIO_PIN_13
#define BUTTON_up_GPIO_Port GPIOB
#define AUDIO_PWM_Pin GPIO_PIN_8
#define AUDIO_PWM_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
